tap "heroku/brew"
tap "homebrew/services"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Parser generator
brew "bison"
# Ruby environment tool
brew "chruby"
# High-level C binding for ZeroMQ
brew "czmq"
# Small tool to convert Djvu files to PDF files
brew "djvu2pdf"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GNU compiler collection
brew "gcc"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Improved top (interactive process viewer)
brew "htop"
# Configurable static site generator
brew "hugo"
# Get events and tasks from the macOS calendar database
brew "ical-buddy"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# YAML Parser
brew "libyaml"
# Interactive environments for writing and running code
brew "jupyterlab"
# Portable Foreign Function Interface library
brew "libffi"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Open-source, cross-platform JavaScript runtime environment
brew "node@18"
# Adds support for geographic objects to PostgreSQL
brew "postgis"
# PostgreSQL: see Brewfile.studio or Brewfile.air
# Monitor data's progress through a pipe
brew "pv"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruby-install"
# Rust toolchain installer
brew "rustup"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Utility-first CSS framework
brew "tailwindcss"
# User interface to the TELNET protocol
brew "telnet"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Pager/text based browser
brew "w3m"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Enable Windows-like alt-tab
cask "alt-tab"
# Terminal-based AI coding assistant
cask "claude-code"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Open-source screen recorder built with web technology
cask "kap"
# File archiver
cask "keka"
# Open-source keystroke visualiser
cask "keycastr"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Control your tools with a few keystrokes
cask "raycast"
# Screenshot measurement and annotation tool
cask "shottr"
# Create, edit, browse SQLite databases
cask "sqlitestudio"
# System monitor for the menu bar
cask "stats"
# General-purpose text editor
cask "textmate"
npm "corepack"
